'''
[Fig. 1] 과 같이 N x N 크기 정사각형 모양의 지형을 가진 행성이 있다.
N x N 크기 지형의 각 칸은 농지와 산 중 하나이다.
( 빈 칸은 농지를 의미하고 산 모양의 칸은 산을 의미한다. )

농지에 씨를 심고 1 일이 지나면 싹이 난다.
그 농지에 대해서 1 번째로 싹이 나는 경우, 싹이 난 후 4 ( = 3 + 1 ) 일 이후에 곡식이 열린다.
그 농지에 대해서 K 번째로 싹이 나는 경우, 싹이 난 후 3 + K 일 이후에 곡식이 열린다. ( K 는 1 이상의 정수 )

지구인들은 이 행성에 로봇 “개척자”를 보내어 곡물을 수확하고자 한다.
로봇은 매일 오전과 오후로 나눠서 다음과 같이 동작한다.

1) 로봇은 오전에 현재 위치에서 아래의 작업 중 하나를 수행한다.
  - 현재 농지가 빈 농지이고 로봇이 다음 농지로 이동할 수 있는 경우 씨를 심는다.
  - 현재 농지가 빈 농지이고, 로봇이 다음 농지로 이동할 수 없을 경우 아무것도 하지 않고 현재 위치에서 머무른다.
  - 현재 농지에 곡식이 열린 경우 수확을 한다. 수확을 하면 농지는 빈 농지가 된다.
2) 로봇은 오후에 로봇이 바라보는 방향의 오른쪽, 앞쪽, 왼쪽, 뒤쪽 이웃하는 곳 중, 이동 가능한 곳으로 이동한다.
  - 이동 가능한 곳은 빈 농지, 또는 곡식이 열린 농지이다. 산이거나 싹이 나는 농지인 경우 이동이 불가능하다.
  - 만약, 이동 가능한 곳이 여러 개인 경우, 로봇의 오른쪽, 앞쪽, 왼쪽, 뒤쪽의 순서로 가장 먼저인 이동 가능한 곳으로 이동한다.
  - 만약 이동 가능한 곳이 없는 경우 로봇은 이동하지 않고 현재 위치에 머무른다.
3) 다음 날이 되면 과정 1) ~ 2) 를 반복한다.

로봇 “개척자” 는 행성에 도착한 날로부터 M 일 까지 동작할 수 있다.
지구인들은 M 일 동안 곡식을 가장 많이 수확할 수 있는 시작 위치와 방향을 알고 싶어한다.
행성의 지형 정보가 주어졌을 때, M 일 동안 “개척자” 로봇이 곡식을 가장 많이 수확할 수 있는 시작 위치와 방향을 찾고,
이때 수확 횟수를 출력하는 프로그램을 작성하라.

[예제]
입력으로 [Fig. 1] 과 같은 지형 정보가 주어지고, "개척자" 로봇이 11 일 동안 동작했을 때
가장 많이 수확할 수 있는 경우를 찾는 것을 생각해 보자. (N = 6, M = 11)
[Fig. 3] 과 같이 로봇을 가로 방향으로 4 번째 세로 방향으로 4 번째인 지형에 왼쪽 방향으로 배치했을 때,
행성에 도착한 후 1 일째 되는 날, [Fig. 4] 와 같이 움직인다.
오전에 씨를 뿌리고 오후에는 로봇의 오른쪽 방향인 위로 한 칸 움직인다.
2 일째에는 [Fig. 5] 와 같이 움직인다.
싹이 난 농지의 오른쪽 위 숫자는 싹이 난 후 지난 일자이다.
3 일째 [Fig. 6] 과 같이 움직인다.
4 일째에는 [Fig. 7] 과 같이, 로봇의 방향을 유지한 채 앞으로 이동한다.
로봇이 바라보고 있는 방향의 오른쪽 농지에 싹이 나 있으므로, 오른쪽 방향으로 이동이 불가능하다.
4 일이 지난 후 부터 9 일째까지의 움직임은 [Fig. 8] 과 같다.
6 일째 되는 날, 로봇은 위로 이동한다.
( 이동하는 곳은 처음으로 씨를 뿌려 싹이 난 농지이고, 4 일이 지나 곡식이 열렸기 때문에 로봇이 이동할 수 있다. )
그리고 다음 날인 7 일째에는 수확을 하고 이동하며, 이와 같은 방법으로 로봇은 8 ~ 9 일째 되는 날에도 수확하고 이동한다.
9 일이 지난 후 부터 11 일째까지의 움직임은 [Fig. 9] 와 같다.

모두 수확한 횟수는 4 이고 이 경우가 가장 많이 수확한 경우 중 하나이다.
본 예제에 대한 정답으로 4 를 출력한다.


[제약사항]
1. 지형의 한 변의 길이 N 은 6 이상 9 이하의 정수이다. ( 6 ≤ N ≤ 9 )
2. 로봇이 동작하는 일 수 M 은 10 이상 50 이하의 정수이다. ( 10 ≤ M ≤ 50 )
3. 지형의 테두리는 언제나 산이다.
4. 지형 정보에서 0 은 농지, 1 은 산을 의미한다.
5. 주어지는 지형에는 반드시 농지가 1 개 이상 있다.
6. 로봇의 시작점은 언제나 농지이어야 한다. 산에서 시작할 수 없다.

[입력]
입력의 맨 첫 줄에는 총 테스트 케이스의 개수 T 가 주어지고,
그 다음 줄부터 T 개의 테스트 케이스가 주어진다.
각 테스트 케이스의 첫 번째 줄에는 지형의 한 변의 길이 N, 로봇이 동작 가능한 일 수 M 이 주어진다.
다음 N 개의 줄에는 지형 정보가 주어진다. 농지는 0, 산은 1 로 주어진다.



[출력]
테스트 케이스 개수만큼 T 개의 줄에 각각의 테스트 케이스에 대한 답을 출력한다.
각 줄은 "#t" 로 시작하고 공백을 하나 둔 다음 정답을 출력한다. ( t 는 1 부터 시작하는 테스트 케이스의 번호이다. )
출력해야 할 정답은, 로봇 "개척자" 의 최대 수확 횟수이다.

[입출력 예]
입력 예
10      // 총 테스트 케이스 개수 T = 10
6 11    // 첫 번째 테스트 케이스, N = 6, M = 11, 본문 예제
1 1 1 1 1 1
1 1 0 0 0 1
1 0 0 0 0 1
1 1 0 0 0 1
1 0 0 0 0 1
1 1 1 1 1 1
…

// 나머지는 sample_input.txt 참조
예제 입력에 대한 정답 출력

#1 4
#2 0
#3 10
#4 11
#5 16
#6 14
#7 20
#8 18
#9 15
#10 22
'''


import sys
sys.stdin = open('sample_input2.txt', 'r')

T = int(input())

# 로봇의 탐색 방향은 우, 하, 좌, 상 방향으로 진행
dx = [1, -1, 0, 0]
dy = [0, 0, 1, -1]

# 로봇의 방향은 우, 하, 좌, 상 방향으로 진행
robot_dirs = [(1, 0), (0, 1), (-1, 0), (0, -1)]

for test_case in range(1, T + 1):
    n, m = map(int, input().split())
    field = [list(map(int, input().split())) for _ in range(n)]
    harvest_max = 0

    for r in range(n):
        for c in range(n):
            if field[r][c]:
                continue

            # 시작 방향 설정
            # 4가지 방향 모두 탐색해야함
            for robot_dir in robot_dirs:
                total = 0
                r_x, r_y = robot_dir[0], robot_dir[1]
            
            # 탐색 시작
                # 오전
                # 다음 농지로 이동할 수 있음
                if not field[r + r_x][c + r_y]:
                    # 씨를 뿌린다
                    field[r + r_x][c + r_y] = 2
                # 다음 농지로 이동할 수 없음
                    # 현재 위치에 머무름

                # 곡식이 열림
                if field[r][c] == 5:
                    # 곡식을 수확하고, 빈 농지로 변경
                    total += 1
                    field[r][c] = 0
            
                # 오후
                # 오른쪽, 앞쪽, 왼쪽, 뒤쪽 순서로 이동가능한지 검사
                # 근데 여기를 현재 로봇의 방향을 기준으로 설정해야됨
                for x, y in zip(dx, dy):
                    nx = r + x
                    ny = c + y
                    # 이동은 빈 농지 or 곡식이 열린 농지
                    if field[nx][ny] == 0 or field[nx][ny] == 5:
                        
                # 이동할 수 없으면 머무름

                # 이렇게 하루 일정이 끝나고 m일 만큼 반복
                # 하루가 끝날 떄 마다 field에 있는 곡식 정보 Update

                # 탐색이 종료되면 수확한 곡식이 max 값과 비교
                harvest_max = max(total, harvest_max)

    # 최대로 수확한 값을 출력
    print(f"#{test_case} {harvest_max}")
